<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"8ace64c933a15ca9dd748be425f3752bd7e13a770abefa0776bdd5078972202b","plan_job_ref":"Job CICD for Splitrr Infra #24 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655627522","plan_out_hash":"e88068a0d1f904db579aa68ca72fc57a042abae232c177ce09d1439c0848923a","plan_hash":"0b4de278e488ba28f6fd039ed19ae044749462ad6404f154d12f7dd15d92360b","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 22 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_cpu will be created
+   resource "aws_appautoscaling_policy" "ecs_target_cpu" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-cpu-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_memory will be created
+   resource "aws_appautoscaling_policy" "ecs_target_memory" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-memory-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_target.ecs_target will be created
+   resource "aws_appautoscaling_target" "ecs_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 1
+       min_capacity       = 1
+       resource_id        = "***********************************************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       suspended_state (known after apply)
    }

  # module.ecs-ec2.aws_autoscaling_group.app_asg will be created
+   resource "aws_autoscaling_group" "app_asg" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       force_delete                     = false
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 0
+       health_check_type                = "EC2"
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 2
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = (known after apply)
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = [
+           "subnet-0976aa1e5727a1645",
+           "subnet-0d6f60a42ff1b4811",
        ]
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = "$Latest"
        }

+       mixed_instances_policy (known after apply)

+       tag {
+           key                 = "Creator"
+           propagate_at_launch = true
+           value               = "bibeklabh@lftechnology.com"
        }
+       tag {
+           key                 = "Name"
+           propagate_at_launch = true
+           value               = "splitrr-dev-backend-ecs-ec2-asg"
        }
+       tag {
+           key                 = "Project"
+           propagate_at_launch = true
+           value               = "Splitrr"
        }

+       traffic_source (known after apply)
    }

  # module.ecs-ec2.aws_cloudwatch_log_group.ecs will be created
+   resource "aws_cloudwatch_log_group" "ecs" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/ecs/splitrr-dev-backend-ecs-ec2"
+       name_prefix       = (known after apply)
+       retention_in_days = 14
+       skip_destroy      = false
+       tags              = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-log-group"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-log-group"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_ecs_capacity_provider.main will be created
+   resource "aws_ecs_capacity_provider" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       auto_scaling_group_provider {
+           auto_scaling_group_arn         = (known after apply)
+           managed_draining               = (known after apply)
+           managed_termination_protection = "DISABLED"

+           managed_scaling {
+               instance_warmup_period    = (known after apply)
+               maximum_scaling_step_size = 1
+               minimum_scaling_step_size = 1
+               status                    = "ENABLED"
+               target_capacity           = 100
            }
        }
    }

  # module.ecs-ec2.aws_ecs_cluster.main will be created
+   resource "aws_ecs_cluster" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "EC2-ECS-CLUSTER"
+       tags     = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-cluster"
        }
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-cluster"
+           "Project" = "Splitrr"
        }

+       setting (known after apply)
    }

  # module.ecs-ec2.aws_ecs_cluster_capacity_providers.main will be created
+   resource "aws_ecs_cluster_capacity_providers" "main" {
+       capacity_providers = [
+           "splitrr-dev-backend-ecs-ec2-capacity-provider",
        ]
+       cluster_name       = "EC2-ECS-CLUSTER"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }
    }

  # module.ecs-ec2.aws_ecs_service.app will be created
+   resource "aws_ecs_service" "app" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = (known after apply)
+       name                               = "splitrr-dev-backend-ecs-ec2-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-service"
+           "Project" = "Splitrr"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }

+       load_balancer {
+           container_name   = "splitrr-dev-backend-ecs-ec2-container"
+           container_port   = 3001
+           target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:949263681218:targetgroup/splitrr-dev-lb-lb-tg/49769ce467dad4e9"
#            (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = [
+               "subnet-0976aa1e5727a1645",
+               "subnet-0d6f60a42ff1b4811",
            ]
        }

+       ordered_placement_strategy {
+           field = "attribute:ecs.availability-zone"
+           type  = "spread"
        }
    }

  # module.ecs-ec2.aws_ecs_task_definition.app will be created
+   resource "aws_ecs_task_definition" "app" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   environment      = [
+                       {
+                           name  = "NODE_ENV"
+                           value = "prod"
                        },
                    ]
+                   essential        = true
+                   image            = "949263681218.dkr.ecr.us-east-1.amazonaws.com/splitrr-dev-ecr-repository:dev"
+                   logConfiguration = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "/ecs/splitrr-dev-backend-ecs-ec2"
+                           awslogs-region        = "ap-southeast-2"
+                           awslogs-stream-prefix = "app"
                        }
                    }
+                   name             = "splitrr-dev-backend-ecs-ec2-container"
+                   portMappings     = [
+                       {
+                           containerPort = 8080
+                           hostPort      = 8080
                        },
                    ]
+                   secrets          = [
+                       {
+                           name      = "COGNITO_CLIENT_ID"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:COGNITO_CLIENT_ID::"
                        },
+                       {
+                           name      = "COGNITO_REGION"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:COGNITO_REGION::"
                        },
+                       {
+                           name      = "COGNITO_USER_POOL_ID"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:COGNITO_USER_POOL_ID::"
                        },
+                       {
+                           name      = "DB_URL"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:DATABASE_URL::"
                        },
+                       {
+                           name      = "PORT"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:PORT::"
                        },
+                       {
+                           name      = "POSTGRES_DB_NAME"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:POSTGRES_DB_NAME::"
                        },
+                       {
+                           name      = "POSTGRES_PASSWORD"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:POSTGRES_PASSWORD::"
                        },
+                       {
+                           name      = "POSTGRES_USER"
+                           valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:POSTGRES_USER::"
                        },
                    ]
                },
            ]
        )
+       cpu                      = "1200"
+       execution_role_arn       = (known after apply)
+       family                   = "splitrr-dev-backend-ecs-ec2-task-def"
+       id                       = (known after apply)
+       memory                   = "700"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "EC2",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
+       tags_all                 = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-task-def"
+           "Project" = "Splitrr"
        }
+       task_role_arn            = (known after apply)
+       track_latest             = false
    }

  # module.ecs-ec2.aws_iam_instance_profile.ecs_node will be created
+   resource "aws_iam_instance_profile" "ecs_node" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "splitrr-dev-backend-ecs-ec2-node-profile"
+       path        = "/ecs/instance/"
+       role        = (known after apply)
+       tags_all    = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id   = (known after apply)
    }

  # module.ecs-ec2.aws_iam_role.ecs_exec_role will be created
+   resource "aws_iam_role" "ecs_exec_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "splitrr-dev-backend-ecs-ec2-exec-role"
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs-ec2.aws_iam_role.ecs_node_role will be created
+   resource "aws_iam_role" "ecs_node_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "splitrr-dev-backend-ecs-ec2-node-role"
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs-ec2.aws_iam_role.ecs_task_role will be created
+   resource "aws_iam_role" "ecs_task_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "splitrr-dev-backend-ecs-ec2-task-role"
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_exec_role_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_exec_role_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_node_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_node_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_node_role_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_node_role_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_node_xray_policy will be created
+   resource "aws_iam_role_policy_attachment" "ecs_node_xray_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_iam_role_policy_attachment.ecs_task_role_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "ecs_task_role_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = (known after apply)
    }

  # module.ecs-ec2.aws_launch_template.ecs_launch_template will be created
+   resource "aws_launch_template" "ecs_launch_template" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = "*********************"
+       instance_type   = "t3.medium"
+       latest_version  = (known after apply)
+       name            = (known after apply)
+       name_prefix     = "splitrr-dev-backend-ecs-ec2-lt"
+       tags_all        = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       user_data       = "IyEvYmluL2Jhc2gKc3VkbyB5dW0gdXBkYXRlIC15CmlmIFsgImRldiIgPT0gImRldiIgXTsgdGhlbgogIGVjaG8gRUNTX0NMVVNURVI9RUMyLUVDUy1DTFVTVEVSID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKZmkKaWYgWyAiZGV2IiAhPSAiZGV2IiBdOyB0aGVuCiAgZWNobyBFQ1NfQ0xVU1RFUj1zcGxpdHJyLWRldi1iYWNrZW5kLWVjcy1lYzItY2x1c3RlciA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCmZpCgo="

+       block_device_mappings {
+           device_name = "/dev/xvda"

+           ebs {
+               delete_on_termination = "true"
+               iops                  = (known after apply)
+               throughput            = (known after apply)
+               volume_size           = 30
+               volume_type           = "gp2"
            }
        }

+       iam_instance_profile {
+           arn = (known after apply)
        }

+       metadata_options (known after apply)

+       network_interfaces {
+           associate_public_ip_address = "false"
+           security_groups             = (known after apply)
        }

+       tag_specifications {
+           resource_type = "instance"
+           tags          = {
+               "Creator" = "bibeklabh@lftechnology.com"
+               "Name"    = "splitrr-dev-backend-ecs-ec2-lt"
+               "Project" = "Splitrr"
            }
        }
    }

  # module.ecs-ec2.aws_security_group.ecs_task will be created
+   resource "aws_security_group" "ecs_task" {
+       arn                    = (known after apply)
+       description            = "Allow all traffic within the VPC"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "10.0.0.0/16",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = "splitrr-dev-backend-ecs-ec2-task-sg"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       vpc_id                 = "*********************"
    }

  # module.ecs-ec2.aws_security_group.lt_sg will be created
+   resource "aws_security_group" "lt_sg" {
+       arn                    = (known after apply)
+       description            = "Security group for launch template"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "splitrr-dev-backend-ecs-ec2-lt-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-lt-sg"
        }
+       tags_all               = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-lt-sg"
+           "Project" = "Splitrr"
        }
+       vpc_id                 = "*********************"
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #24](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655627522)